# AdjustEdgeTooShortWarn Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..AnalyticalModelFailures..::..AdjustEdgeTooShortWarn Property
BuiltInFailures..::..AnalyticalModelFailures Class See Also
---
AdjustEdge is too short.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId AdjustEdgeTooShortWarn { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AdjustEdgeTooShortWarn As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ AdjustEdgeTooShortWarn {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace